//----------------------------------------------------------------------------------------------------------------------
// Exemplo 03: exemplo de passagem por valor
//----------------------------------------------------------------------------------------------------------------------

#include <iostream>

using namespace std;

//----------------------------------------------------------------------------------------------------------------------
// Protótipos das funções
//----------------------------------------------------------------------------------------------------------------------

int elevaCubo(int n);

//----------------------------------------------------------------------------------------------------------------------
// Função principal
//----------------------------------------------------------------------------------------------------------------------
int main() {

    cout << "\n";
    cout << "Exemplo da Passagem por Valor\n\n";

    // Declara e inicializa a variável
    int numero = 5;

    // Exibe seu valor original
    cout << "* Valor original: " << numero << "\n";

    // Chama a função que eleva ao cubo, passando o argumento por valor
    numero = elevaCubo(numero);

    // Exibe seu valor modificado
    cout << "* Valor modificado: " << numero << "\n\n";

    // Fim do programa
    return 0;

}

//----------------------------------------------------------------------------------------------------------------------
// Definição das funções
//----------------------------------------------------------------------------------------------------------------------

// Calcula e retorna o cubo de um argumento inteiro
int elevaCubo(int n) {

    return n * n * n;

}
